import { z } from "zod";

export const studentSchema = z.object({
  studentCode: z
    .string()
    // ใช้ Regular Expression บังคับว่าต้องขึ้นต้นด้วยตัวเลข 9 ตัว ตามด้วยขีดกลาง และจบด้วยตัวเลข 1 ตัวเสมอ
    .regex(
      /^\d{9}-\d{1}$/,
      "รหัสนักศึกษาต้องประกอบด้วยตัวเลข 9 ตัว เครื่องหมาย - และตัวเลข 1 ตัว (เช่น 673450000-0)",
    ),
  name: z
    .string()
    .min(1, "กรุณากรอกชื่อ-นามสกุล")
    .max(100, "ชื่อ-นามสกุลต้องไม่เกิน 100 ตัวอักษร"),
  email: z
    .string()
    .email("รูปแบบ Email ไม่ถูกต้อง")
    .optional() // รองรับค่าที่ไม่มี (undefined)
    .or(z.literal("")),
  major: z
    .string()
    .min(1, "กรุณากรอกสาขา")
    .max(100, "ชื่อสาขาต้องไม่เกิน 100 ตัวอักษร"),
  year: z
    .number()
    .int("ชั้นปีต้องเป็นจำนวนเต็ม")
    .min(1, "ชั้นปีต้องไม่น้อยกว่า 1")
    .max(8, "ชั้นปีต้องไม่มากกว่า 8"),
});
